In [5]:
from models import Cryptocurrency, Transaction

from tools import (generate_uri_from_file,
                   get_symbol_to_id_dict,
                   get_id_to_symbol_dict)

In [6]:
def get_id(db, ticker='BTC'):
    '''returns the symbol id of the given ticker'''
    sym_to_id_map = get_symbol_to_id_dict(db)
    ticker_id = sym_to_id_map.get(ticker.upper(), None)  #returns ticker_id if it is found, and None when it does not exist
    return None

---
## Database URI
In this section I'm creating the URI to the database so we can connect more easily . I'm making use of my function `generate_uri_from_file` to take the configuration Yaml file as input and return the URI string.

In [7]:
uri = generate_uri_from_file("db_config.yml")

---
## Using Flask-SQLAlchemy to Read and Write to DB
In this section, I will use the flask-SQLAlchemy package to read and write from and to the database.

In [8]:
from flask_sqlalchemy import SQLAlchemy
from flask import Flask

In [9]:
db = SQLAlchemy()
app = Flask(__name__)

In [10]:
app.config['SQLALCHEMY_TRACK_MODIFICATIONS'] = False
app.config['SQLALCHEMY_DATABASE_URI'] = uri

In [11]:
db.init_app(app)

#### Using App Context
We need to make use of Flask's app_context method in order to query the database (for standalone scripts). You will get an error if you don't.

In [45]:
with app.app_context():
    results = db.session.query(Transaction).all()   #original example
    #results = db.session.query(Transaction).limit(2).all()  
    #results = Transaction.query.limit(2).all()

In [46]:
results

[<Transaction: ticker_id=1, coins=100.000000000, cost basis=3999.00000>,
 <Transaction: ticker_id=1, coins=45.000000000, cost basis=10000.00000>,
 <Transaction: ticker_id=1, coins=1.000000000, cost basis=34000.00000>,
 <Transaction: ticker_id=2, coins=0.123456789, cost basis=350.00000>,
 <Transaction: ticker_id=3, coins=1500.000000000, cost basis=100.00000>,
 <Transaction: ticker_id=4, coins=1500.000000000, cost basis=1215.00000>]

#### How to Retrieve Conditional Data
Retrieving only data that meets certain conditions. For instance, maybe I want to query the data for only the transactions related to Bitcoin (in this case, I would need to know Bitcoins ticker_id on the "transactions" table. The id is 1.

In [14]:
#Example 1: Returning only Bitcoin transactions (Bitcoin's ticker_id is 1)
with app.app_context():
    results = db.session.query(Transaction).filter(Transaction.ticker_id==1).all()

In [15]:
results

[<Transaction: ticker_id=1, coins=100.000000000, cost basis=3999.00000>,
 <Transaction: ticker_id=1, coins=45.000000000, cost basis=10000.00000>,
 <Transaction: ticker_id=1, coins=1.000000000, cost basis=34000.00000>]

In [16]:
#Example 2: Returning only Bitcoin transactions and only those that have more than 2 coins per transaction
with app.app_context():
    results = db.session.query(Transaction).filter(Transaction.ticker_id==1, 
                                                   Transaction.num_coins > 2).all()

In [17]:
results

[<Transaction: ticker_id=1, coins=100.000000000, cost basis=3999.00000>,
 <Transaction: ticker_id=1, coins=45.000000000, cost basis=10000.00000>]

#### Writing to the Database
I will create a new sample transaction and write it to the database. In this example, I will add a new XRP transaction. Therefore, we first need to query the table cryptocurrencies to get the appropriate object. If XRP does not exist on the table yet, it will be added as well.

In [48]:
_coin = 'XRP'

with app.app_context():
    
    #create our new transaction
    new_tx = Transaction(num_coins=1500, cost_basis=1215)  #$1,215 assumes an XRP price of around $0.81 -> 1500 XRP * $0.81 ~= $1215
    
    #---Retrieve coin from DB
    coin_obj = db.session.query(Cryptocurrency).filter(Cryptocurrency.ticker==_coin).first()
    if coin_obj is None:
        coin_obj = Cryptocurrency(_coin) #if it does not exist, we create a new object
        db.session.add(coin_obj)
        #db.session.commit()
    
    coin_obj.transactions.append(new_tx)
    db.session.add(new_tx)
    db.session.commit()

You can run the toy application with flask (run `python app.py` in the terminal) to check that the data is indeed added to the database. You can also query the database for XRP transactions following the steps I showed already. Other ways of checking the database include accessing the MySQL terminal or some graphical program where you can see your tables and content.

---
## Using SQLAlchemy for CRUD Operations
In this section I'll show how to use SQLAlchemy directly for working with our database. First, we import `create_engine` from SQLAlchemy. This [blog post](https://hackersandslackers.com/database-queries-sqlalchemy-orm/) has been very helpful to me in using SQLAlchemy (it is very similar to using Flask-SQLAlchemy). Also take a look at [this post](https://flask.palletsprojects.com/en/2.0.x/patterns/sqlalchemy/) from the Flaks website on using SQLAlchemy with Flask.

In [52]:
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

In [53]:
db_engine = create_engine(uri, echo=False)
db_engine

Engine(mysql://test_user:***@localhost:3306/test_db)

In [55]:
SessionObject = sessionmaker(bind=db_engine)
session = SessionObject()   #this is the handle on the current session

#### Reading From the Database

In [60]:
session.query(Transaction).filter(Transaction.ticker_id==1).all()

[<Transaction: ticker_id=1, coins=100.000000000, cost basis=3999.00000>,
 <Transaction: ticker_id=1, coins=45.000000000, cost basis=10000.00000>,
 <Transaction: ticker_id=1, coins=1.000000000, cost basis=34000.00000>]

#### Writing to the Database
I'll convert the basic example from the previous section to work with SQLAlchemy.

In [66]:
_coin = 'XRP'
new_tx = Transaction(num_coins=100, cost_basis=80)

coin_obj = session.query(Cryptocurrency).filter(Cryptocurrency.ticker==_coin).first()
if coin_obj is None:
    coin_obj = Cryptocurrency(ticker=_coin)
    session.add(coin_obj)

coin_obj.transactions.append(new_tx)
session.add(new_tx)
session.commit()

---
## Using Pandas for CRUD Operations
Pandas has built-in methods that allows us to query a database and also write to one.

In [67]:
import pandas as pd

#### Reading

- Creating the SQL Query statement

In [76]:
#getting sql statement using SQLAlchemy
sql_statement = session.query(Transaction).statement
sql_statement

- Using Flask-SQLAlchemy engine

In [72]:
with app.app_context():
    df = pd.read_sql(sql=sql_statement, con=db.session.bind)

In [73]:
df

   id  ticker_id    num_coins  cost_basis        last_updated
0   1          1   100.000000      3999.0 2022-02-11 22:21:19
1   2          1    45.000000     10000.0 2022-02-11 22:25:03
2   3          1     1.000000     34000.0 2022-02-11 22:25:20
3   4          2     0.123457       350.0 2022-02-12 09:04:48
4   5          3  1500.000000       100.0 2022-02-12 09:16:04
5   6          4  1500.000000      1215.0 2022-02-17 11:44:25
6   7          5  1500.000000      1215.0 2022-02-17 17:05:24
7   8          4  1500.000000      1215.0 2022-02-17 17:07:08
8   9          6   100.000000        80.0 2022-02-17 17:49:49

- Using SQLAlchemy engine

In [74]:
df = pd.read_sql(sql=sql_statement, con=db_engine)

In [75]:
df

   id  ticker_id    num_coins  cost_basis        last_updated
0   1          1   100.000000      3999.0 2022-02-11 22:21:19
1   2          1    45.000000     10000.0 2022-02-11 22:25:03
2   3          1     1.000000     34000.0 2022-02-11 22:25:20
3   4          2     0.123457       350.0 2022-02-12 09:04:48
4   5          3  1500.000000       100.0 2022-02-12 09:16:04
5   6          4  1500.000000      1215.0 2022-02-17 11:44:25
6   7          5  1500.000000      1215.0 2022-02-17 17:05:24
7   8          4  1500.000000      1215.0 2022-02-17 17:07:08
8   9          6   100.000000        80.0 2022-02-17 17:49:49

#### Writing
I will load a csv file included in the repository with sample transactions as a dataframe.

In [80]:
transactions_df = pd.read_csv("transactions.csv",)
transactions_df

    ticker_id  num_coins  cost_basis
0           1       10.0      450000
1           1        1.0       45000
2           3       30.0        3000
3           5       10.0        2000
4           2      100.0      100000
5           2        1.0        3000
6           2       30.0     9000000
7           1        0.5       22000
8           4      100.0          80
9           4      200.0         160
10          4       50.0          40

In [83]:
tablename = 'transactions'
transactions_df.to_sql(
    name      = tablename,
    con       = db_engine,
    if_exists = 'append',
    index     = False, )

11